Tekla.Structures.DirectManipulation.Adapter.Synchronizer
The Tekla.Structures.DirectManipulation.Adapter.Synchronizer class controls all synchronization to AKit.

Tekla.Structures.DirectManipulation.Adapter.Synchronizer.#cctor
Initializes static members of the Tekla.Structures.DirectManipulation.Adapter.Synchronizer class.

Tekla.Structures.DirectManipulation.Adapter.Synchronizer.InvokeRequired
Gets a value indicating whether or not the caller is running in the Akit thread.

Tekla.Structures.DirectManipulation.Adapter.Synchronizer.AssertSynchronization
Asserts that Tekla.Structures.DirectManipulation.Adapter.Synchronizer.InvokeRequired is false.

Tekla.Structures.DirectManipulation.Adapter.Synchronizer.Invoke(System.Action)
Synchronously executes the delegate on the Akit thread.
method: The method to execute.

Tekla.Structures.DirectManipulation.Adapter.Synchronizer.Invoke``1(System.Action{``0},``0)
Synchronously executes the delegate on the Akit thread.
The type of the parameter of the method that this delegate encapsulates.
method: The method to execute.
arg: The parameter of the method that this delegate encapsulates.

Tekla.Structures.DirectManipulation.Adapter.Synchronizer.Invoke``2(System.Action{``0,``1},``0,``1)
Synchronously executes the delegate on the Akit thread.
The type of the first parameter of the method that this delegate encapsulates.
The type of the second parameter of the method that this delegate encapsulates.
method: The method to execute.
arg1: The first parameter of the method that this delegate encapsulates.
arg2: The second parameter of the method that this delegate encapsulates.

Tekla.Structures.DirectManipulation.Adapter.Synchronizer.Invoke``3(System.Action{``0,``1,``2},``0,``1,``2)
Synchronously executes the delegate on the Akit thread.
The type of the first parameter of the method that this delegate encapsulates.
The type of the second parameter of the method that this delegate encapsulates.
The type of the third parameter of the method that this delegate encapsulates.
method: The method to execute.
arg1: The first parameter of the method that this delegate encapsulates.
arg2: The second parameter of the method that this delegate encapsulates.
arg3: The third parameter of the method that this delegate encapsulates.

Tekla.Structures.DirectManipulation.Adapter.Synchronizer.Invoke``4(System.Action{``0,``1,``2,``3},``0,``1,``2,``3)
Synchronously executes the delegate on the Akit thread.
The type of the first parameter of the method that this delegate encapsulates.
The type of the second parameter of the method that this delegate encapsulates.
The type of the third parameter of the method that this delegate encapsulates.
The type of the fourth parameter of the method that this delegate encapsulates.
method: The method to execute.
arg1: The first parameter of the method that this delegate encapsulates.
arg2: The second parameter of the method that this delegate encapsulates.
arg3: The third parameter of the method that this delegate encapsulates.
arg4: The fourth parameter of the method that this delegate encapsulates.

Tekla.Structures.DirectManipulation.Adapter.Synchronizer.Invoke``1(System.Func{``0})
Synchronously executes the delegate on the Akit thread.
The type of the return value of the method that this delegate encapsulates.
method: The method to execute.
Returns: An object that represents the return value from the delegate being invoked.

Tekla.Structures.DirectManipulation.Adapter.Synchronizer.Invoke``2(System.Func{``0,``1},``0)
Synchronously executes the delegate on the Akit thread.
The type of the parameter of the method that this delegate encapsulates.
The type of the return value of the method that this delegate encapsulates.
method: The method to execute.
arg: The parameter of the method that this delegate encapsulates.
Returns: The return value of the method that this delegate encapsulates.

Tekla.Structures.DirectManipulation.Adapter.Synchronizer.Invoke``3(System.Func{``0,``1,``2},``0,``1)
Synchronously executes the delegate on the Akit thread.
The type of the first parameter of the method that this delegate encapsulates.
The type of the second parameter of the method that this delegate encapsulates.
The type of the return value of the method that this delegate encapsulates.
method: The method to execute.
arg1: The first parameter of the method that this delegate encapsulates.
arg2: The second parameter of the method that this delegate encapsulates.
Returns: The return value of the method that this delegate encapsulates.

Tekla.Structures.DirectManipulation.Adapter.Synchronizer.Invoke``4(System.Func{``0,``1,``2,``3},``0,``1,``2)
Synchronously executes the delegate on the Akit thread.
The type of the first parameter of the method that this delegate encapsulates.
The type of the second parameter of the method that this delegate encapsulates.
The type of the third parameter of the method that this delegate encapsulates.
The type of the return value of the method that this delegate encapsulates.
method: The method to execute.
arg1: The first parameter of the method that this delegate encapsulates.
arg2: The second parameter of the method that this delegate encapsulates.
arg3: The third parameter of the method that this delegate encapsulates.
Returns: The return value of the method that this delegate encapsulates.

Tekla.Structures.DirectManipulation.Adapter.Synchronizer.Invoke``5(System.Func{``0,``1,``2,``3,``4},``0,``1,``2,``3)
Synchronously executes the delegate on the Akit thread.
The type of the first parameter of the method that this delegate encapsulates.
The type of the second parameter of the method that this delegate encapsulates.
The type of the third parameter of the method that this delegate encapsulates.
The type of the fourth parameter of the method that this delegate encapsulates.
The type of the return value of the method that this delegate encapsulates.
method: The method to execute.
arg1: The first parameter of the method that this delegate encapsulates.
arg2: The second parameter of the method that this delegate encapsulates.
arg3: The third parameter of the method that this delegate encapsulates.
arg4: The fourth parameter of the method that this delegate encapsulates.
Returns: The return value of the method that this delegate encapsulates.

Tekla.Structures.DirectManipulation.Adapter.Synchronizer.Queue(System.Action)
Queues a delegate for execution on the Akit thread.
method: The method to execute.

Tekla.Structures.DirectManipulation.Adapter.Synchronizer.Queue``1(System.Action{``0},``0)
Queues a delegate for execution on the Akit thread.
The type of the parameter of the method that this delegate encapsulates.
method: The method to execute.
arg: The parameter of the method that this delegate encapsulates.

Tekla.Structures.DirectManipulation.Adapter.Synchronizer.Queue``2(System.Action{``0,``1},``0,``1)
Queues a delegate for execution on the Akit thread.
The type of the first parameter of the method that this delegate encapsulates.
The type of the second parameter of the method that this delegate encapsulates.
method: The method to execute.
arg1: The first parameter of the method that this delegate encapsulates.
arg2: The second parameter of the method that this delegate encapsulates.

Tekla.Structures.DirectManipulation.Adapter.Synchronizer.Queue``3(System.Action{``0,``1,``2},``0,``1,``2)
Queues a delegate for execution on the Akit thread.
The type of the first parameter of the method that this delegate encapsulates.
The type of the second parameter of the method that this delegate encapsulates.
The type of the third parameter of the method that this delegate encapsulates.
method: The method to execute.
arg1: The first parameter of the method that this delegate encapsulates.
arg2: The second parameter of the method that this delegate encapsulates.
arg3: The third parameter of the method that this delegate encapsulates.

Tekla.Structures.DirectManipulation.Adapter.Synchronizer.Queue``4(System.Action{``0,``1,``2,``3},``0,``1,``2,``3)
Queues a delegate for execution on the Akit thread.
The type of the first parameter of the method that this delegate encapsulates.
The type of the second parameter of the method that this delegate encapsulates.
The type of the third parameter of the method that this delegate encapsulates.
The type of the fourth parameter of the method that this delegate encapsulates.
method: The method to execute.
arg1: The first parameter of the method that this delegate encapsulates.
arg2: The second parameter of the method that this delegate encapsulates.
arg3: The third parameter of the method that this delegate encapsulates.
arg4: The fourth parameter of the method that this delegate encapsulates.

Tekla.Structures.DirectManipulation.Adapter.Synchronizer.BeginInvoke(System.Delegate,System.Object[])
Asynchronously executes the delegate on the Akit thread.
method: A System.Delegate to a method that takes parameters of the same number and type that are contained in args.
args: The collection of objects to pass as arguments to the given method. This can be nothing if no arguments are needed.
Returns: An System.IAsyncResult interface that represents the asynchronous operation started by calling this method.

Tekla.Structures.DirectManipulation.Adapter.Synchronizer.EndInvoke(System.IAsyncResult)
Waits until the process started by calling Tekla.Structures.DirectManipulation.Adapter.Synchronizer.BeginInvoke(System.Delegate,System.Object[]) completes, and then returns the value generated by the process.
result: An System.IAsyncResult interface that represents the asynchronous operation started by calling Tekla.Structures.DirectManipulation.Adapter.Synchronizer.BeginInvoke(System.Delegate,System.Object[]).
Returns: An object that represents the return value generated by the asynchronous operation.

Tekla.Structures.DirectManipulation.Adapter.Synchronizer.InvokeDelegate(System.Delegate,System.Object[])
Synchronously executes the delegate on the Akit thread.
method: A System.Delegate to a method that takes parameters of the same number and type that are contained in args.
args: The collection of objects to pass as arguments to the given method. This can be nothing if no arguments are needed.
Returns: An object that represents the return value from the delegate being invoked, or null if the delegate has no return value.

Tekla.Structures.DirectManipulation.Adapter.Synchronizer.QueueDelegate(System.Delegate,System.Object[])
Queues a delegate for execution on the Akit thread.
method: A System.Delegate to a method that takes parameters of the same number and type that are contained in args.
args: The collection of objects to pass as arguments to the given method. This can be nothing if no arguments are needed.